In [1]:
import pandas as pd

In [3]:
data = [1,2,3,4,5,56,6,7,8,8,9,3]

In [4]:
series = pd.Series(data)

In [5]:
series

0      1
1      2
2      3
3      4
4      5
5     56
6      6
7      7
8      8
9      8
10     9
11     3
dtype: int64

In [8]:
data = [{'a':1,'b':2,'c':3},{'a':4,'b':5,'c':6}]
df = pd.DataFrame(data)
df

   a  b  c
0  1  2  3
1  4  5  6

In [12]:
data = [1,2,3,4,5]
id =['Deepak','Viktus','Ravi','Ankit','John']
df = pd.DataFrame(data, index=id,columns=['Numbers'])
df

        Numbers
Deepak        1
Viktus        2
Ravi          3
Ankit         4
John          5

In [13]:
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}
df = pd.DataFrame(data)
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida

In [22]:
df = pd.read_csv('C:/Users/VICTUS/OneDrive/Desktop/ML-Learning/NumpPandas/sales_data.csv', sep=';')
df.head()

  Transaction ID, Date      , Product Category, Product Name                                              , Units Sold, Unit Price, Total Revenue, Region       , Payment Method
0  10001         , 2024-01-01, Electronics     , ...
1  10002         , 2024-01-02, Home Appliances , ...
2  10003         , 2024-01-03, Clothing        , ...
3  10004         , 2024-01-04, Books           , ...
4  10005         , 2024-01-05, Beauty Products , ...

In [24]:
data = pd.DataFrame(df)
data.describe

<bound method NDFrame.describe of     Transaction ID, Date      , Product Category, Product Name                                              , Units Sold, Unit Price, Total Revenue, Region       , Payment Method
0    10001         , 2024-01-01, Electronics     , ...
1    10002         , 2024-01-02, Home Appliances , ...
2    10003         , 2024-01-03, Clothing        , ...
3    10004         , 2024-01-04, Books           , ...
4    10005         , 2024-01-05, Beauty Products , ...
..                                                 ...
235  10236         , 2024-08-23, Home Appliances , ...
236  10237         , 2024-08-24, Clothing        , ...
237  10238         , 2024-08-25, Books           , ...
238  10239         , 2024-08-26, Beauty Products , ...
239  10240         , 2024-08-27, Sports          , ...

[240 rows x 1 columns]>

In [25]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [26]:
df

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore

In [28]:
name = df['Name']
name

0    Krish
1     John
2    Bappy
3     JAck
Name: Name, dtype: object

In [ ]:
df.iloc[1] 
# means access the second row of the DataFrame.
# iloc stands for index location.
# It is used to access rows or columns in a pandas DataFrame by their integer position (not labels).

Name         John
Age            34
City    Bangalore
Name: 1, dtype: object

In [ ]:
df.iloc[0,1] 
# Accessing specific element at first row and second column

np.int64(32)

In [35]:
## Accessing a specified element
df.at[2,'Age']

np.int64(32)

In [36]:

df.at[2,'Name']

'Bappy'

In [37]:
## Accessing a specified element using iat
df.iat[2,2]

'Bangalore'